In [2]:
print('rahul')

rahul

In [3]:
a=[1,2,34,5]
print(a)

[1, 2, 34, 5]

In [4]:
print(a[3])

5

In [5]:
data = [50,50,47,97,49,3,53,42,26,74,82,62,37,15,70,27,36,35,48,52,63,64]
print(data)

[50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]

In [6]:
import numpy as np
grades=np.array(data)
print(grades)

[50 50 47 97 49  3 53 42 26 74 82 62 37 15 70 27 36 35 48 52 63 64]

In [7]:
print (type(data),'x 2:', data * 2)
print('---')
print (type(grades),'x 2:', grades * 2)

<class 'list'> x 2: [50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64, 50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]
---
<class 'numpy.ndarray'> x 2: [100 100  94 194  98   6 106  84  52 148 164 124  74  30 140  54  72  70
  96 104 126 128]

In [8]:
print(type(data))

<class 'list'>

In [10]:
print(type(grades))

<class 'numpy.ndarray'>

In [11]:
grades.shape

(22,)

grades[0]

In [12]:
grades.mean()

49.18181818181818

In [13]:
study_hours = [10.0,11.5,9.0,16.0,9.25,1.0,11.5,9.0,8.5,14.5,15.5,
               13.75,9.0,8.0,15.5,8.0,9.0,6.0,10.0,12.0,12.5,12.0]
student_data = np.array([study_hours, grades])

In [14]:
print(student_data)

[[10.   11.5   9.   16.    9.25  1.   11.5   9.    8.5  14.5  15.5  13.75
   9.    8.   15.5   8.    9.    6.   10.   12.   12.5  12.  ]
 [50.   50.   47.   97.   49.    3.   53.   42.   26.   74.   82.   62.
  37.   15.   70.   27.   36.   35.   48.   52.   63.   64.  ]]

In [15]:
student_data.shape

(2, 22)

In [18]:
student_data[0][4]

9.25

In [20]:
student_data[1][5]

3.0

In [26]:
avg_study=student_data[0].mean()

In [23]:
avg_grade=student_data[1].mean()

49.18181818181818

In [32]:
avg_study=student_data[0].mean()
avg_grade=student_data[1].mean()
print('avg_study:{:.2f}\n avg_grade:{:.2f}'.format(avg_study, avg_grade))

avg_study:10.52
 avg_grade:49.18

In [8]:
import pandas as pd
students = pd.DataFrame({'Name': ['Dan', 'Joann', 'Pedro', 'Rosie', 'Ethan', 'Vicky', 'Frederic', 'Jimmie', 
                                     'Rhonda', 'Giovanni', 'Francesca', 'Rajab', 'Naiyana', 'Kian', 'Jenny',
                                     'Jakeem','Helena','Ismat','Anila','Skye','Daniel','Aisha'],
                             
                           'study_hours' : [10.0,11.5,9.0,16.0,9.25,1.0,11.5,9.0,8.5,14.5,15.5,
               13.75,9.0,8.0,15.5,8.0,9.0,6.0,10.0,12.0,12.5,12.0],
                         'grade':   [50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]
                         })
students

         Name  study_hours  grade
0         Dan        10.00     50
1       Joann        11.50     50
2       Pedro         9.00     47
3       Rosie        16.00     97
4       Ethan         9.25     49
5       Vicky         1.00      3
6    Frederic        11.50     53
7      Jimmie         9.00     42
8      Rhonda         8.50     26
9    Giovanni        14.50     74
10  Francesca        15.50     82
11      Rajab        13.75     62
12    Naiyana         9.00     37
13       Kian         8.00     15
14      Jenny        15.50     70
15     Jakeem         8.00     27
16     Helena         9.00     36
17      Ismat         6.00     35
18      Anila        10.00     48
19       Skye        12.00     52
20     Daniel        12.50     63
21      Aisha        12.00     64

In [12]:
students.loc[5]

(Name           Vicky
 study_hours      1.0
 grade              3
 Name: 5, dtype: object,
        Name  study_hours  grade
 0       Dan        10.00     50
 1     Joann        11.50     50
 2     Pedro         9.00     47
 3     Rosie        16.00     97
 4     Ethan         9.25     49
 5     Vicky         1.00      3
 6  Frederic        11.50     53)

In [15]:
students.loc[0:6]

       Name  study_hours  grade
0       Dan        10.00     50
1     Joann        11.50     50
2     Pedro         9.00     47
3     Rosie        16.00     97
4     Ethan         9.25     49
5     Vicky         1.00      3
6  Frederic        11.50     53

In [16]:
students.iloc[0:6]

    Name  study_hours  grade
0    Dan        10.00     50
1  Joann        11.50     50
2  Pedro         9.00     47
3  Rosie        16.00     97
4  Ethan         9.25     49
5  Vicky         1.00      3

In [17]:
students.iloc[0,[1,2]]

study_hours    10.0
grade            50
Name: 0, dtype: object

In [23]:
students.loc[2,'grade']

47

In [32]:
df_students.loc[df_students['Name']=='Aisha']

     Name  study_hours  grade
21  Aisha         12.0     64

In [35]:
df_students[df_students['Name']=='Aisha']

     Name  study_hours  grade
21  Aisha         12.0     64

In [36]:
df_students.query('Name=="Aisha"')

     Name  study_hours  grade
21  Aisha         12.0     64

In [37]:
df_students[df_students.Name == 'Aisha']

     Name  study_hours  grade
21  Aisha         12.0     64

In [6]:
import pandas as pd
my_dataset={
    'Name':['Rahul','Pooja','Keerti'],
    'Num':[2,4,6]
}

my=pd.DataFrame(my_dataset)
print(my)

     Name  Num
0   Rahul    2
1   Pooja    4
2  Keerti    6

In [7]:
import pandas as pd
data={
    'car':['Ford','Volvo','KIA'],
    'passings':[8,23,34]    
}

datas=pd.DataFrame(data)
print(datas)

     car  passings
0   Ford         8
1  Volvo        23
2    KIA        34